app/controllers/index_controller.rb

  def index
  	#@about_us = SQlite::Database.new('../../db/development.sqlite3')

		be  = BlogEntry.find_by_title('main')



		seek_array = Product.all
---
SELECT * FROM "blog_entries" WHERE ("blog_entries"."title" = 'main') LIMIT 1
SELECT * FROM "products"